# RadiusSymbolLocation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RadiusSymbolLocation Property
ParameterTypeId Class See Also
---
"Radius Symbol Location"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RadiusSymbolLocation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RadiusSymbolLocation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RadiusSymbolLocation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace